app/views/profiles/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."profile_id" = $1  [["profile_id", 6]]
---
	 		<h2>My Posts</h2>
	    	<% @profile.posts.each do |x| %>