app/controllers/main_controller.rb

SELECT "posts".* FROM "posts"  ORDER BY create_at_DESC
---
  def index
  	@posts = Post.all.order("create_at_DESC")