app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
SELECT AVG(taste) FROM "posts"
---
  def index
  	@posts = Post.all

INSERT INTO "posts" ("name", "description", "price", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "AARON"], ["description", "food"], ["price", "4.0"], ["user_id", 1], ["created_at", "2015-06-03 06:31:32.679651"], ["updated_at", "2015-06-03 06:31:32.679651"]]
---
  def create
    @post = current_user.posts.new(post_params)
    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 9]]
UPDATE "posts" SET "description" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["description", "1sdfgdfg"], ["updated_at", "2015-06-04 07:57:28.553184"], ["id", 11]]
---
  def update
    @post = Post.find(params[:id])

    if @post.update(post_params)