app/controllers/profiles_controller.rb

INSERT INTO "profiles" ("username", "zipcode", "location", "bio", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "lasdgasdfg"], ["zipcode", 21042], ["location", "egypt"], ["bio", "ewraeraer"], ["user_id", 4]]
UPDATE "profiles" SET "user_id" = $1 WHERE "profiles"."id" = $2  [["user_id", nil], ["id", 8]]
---
  def create
    @profile = current_user.create_profile(profile_params)
    if @profile.save

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT 1  [["id", 6]]
UPDATE "profiles" SET "username" = $1, "zipcode" = $2, "location" = $3, "bio" = $4 WHERE "profiles"."id" = $5  [["username", "ewok"], ["zipcode", 20002], ["location", "dc"], ["bio", "im ewok"], ["id", 10]]
---
  def update
    @profile = Profile.find(params[:id])

    if @profile.update(profile_params)